; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p6---int100n150-m25---int100c200---s82---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 level137 level138 level139 level140 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level11 level11)
(sum level0 level14 level14)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level11 level12)
(sum level1 level14 level15)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level11 level13)
(sum level2 level14 level16)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level11 level14)
(sum level3 level14 level17)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level11 level15)
(sum level4 level14 level18)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level11 level16)
(sum level5 level14 level19)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level11 level17)
(sum level6 level14 level20)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level11 level18)
(sum level7 level14 level21)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level11 level19)
(sum level8 level14 level22)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level11 level20)
(sum level9 level14 level23)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level11 level21)
(sum level10 level14 level24)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level11 level22)
(sum level11 level14 level25)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level11 level23)
(sum level12 level14 level26)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level11 level24)
(sum level13 level14 level27)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level11 level25)
(sum level14 level14 level28)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level11 level26)
(sum level15 level14 level29)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level11 level27)
(sum level16 level14 level30)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level11 level28)
(sum level17 level14 level31)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level11 level29)
(sum level18 level14 level32)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level11 level30)
(sum level19 level14 level33)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level11 level31)
(sum level20 level14 level34)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level11 level32)
(sum level21 level14 level35)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level11 level33)
(sum level22 level14 level36)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level11 level34)
(sum level23 level14 level37)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level11 level35)
(sum level24 level14 level38)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level11 level36)
(sum level25 level14 level39)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level11 level37)
(sum level26 level14 level40)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level11 level38)
(sum level27 level14 level41)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level11 level39)
(sum level28 level14 level42)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level11 level40)
(sum level29 level14 level43)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level11 level41)
(sum level30 level14 level44)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level11 level42)
(sum level31 level14 level45)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level11 level43)
(sum level32 level14 level46)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level11 level44)
(sum level33 level14 level47)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level11 level45)
(sum level34 level14 level48)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level11 level46)
(sum level35 level14 level49)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level11 level47)
(sum level36 level14 level50)
(sum level36 level22 level58)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level11 level48)
(sum level37 level14 level51)
(sum level37 level22 level59)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level11 level49)
(sum level38 level14 level52)
(sum level38 level22 level60)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level11 level50)
(sum level39 level14 level53)
(sum level39 level22 level61)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level11 level51)
(sum level40 level14 level54)
(sum level40 level22 level62)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level11 level52)
(sum level41 level14 level55)
(sum level41 level22 level63)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level11 level53)
(sum level42 level14 level56)
(sum level42 level22 level64)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level11 level54)
(sum level43 level14 level57)
(sum level43 level22 level65)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level11 level55)
(sum level44 level14 level58)
(sum level44 level22 level66)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level11 level56)
(sum level45 level14 level59)
(sum level45 level22 level67)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level11 level57)
(sum level46 level14 level60)
(sum level46 level22 level68)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level11 level58)
(sum level47 level14 level61)
(sum level47 level22 level69)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level11 level59)
(sum level48 level14 level62)
(sum level48 level22 level70)
(sum level48 level23 level71)
(sum level49 level1 level50)
(sum level49 level11 level60)
(sum level49 level14 level63)
(sum level49 level22 level71)
(sum level49 level23 level72)
(sum level50 level1 level51)
(sum level50 level11 level61)
(sum level50 level14 level64)
(sum level50 level22 level72)
(sum level50 level23 level73)
(sum level51 level1 level52)
(sum level51 level11 level62)
(sum level51 level14 level65)
(sum level51 level22 level73)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level11 level63)
(sum level52 level14 level66)
(sum level52 level22 level74)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level11 level64)
(sum level53 level14 level67)
(sum level53 level22 level75)
(sum level53 level23 level76)
(sum level54 level1 level55)
(sum level54 level11 level65)
(sum level54 level14 level68)
(sum level54 level22 level76)
(sum level54 level23 level77)
(sum level55 level1 level56)
(sum level55 level11 level66)
(sum level55 level14 level69)
(sum level55 level22 level77)
(sum level55 level23 level78)
(sum level56 level1 level57)
(sum level56 level11 level67)
(sum level56 level14 level70)
(sum level56 level22 level78)
(sum level56 level23 level79)
(sum level57 level1 level58)
(sum level57 level11 level68)
(sum level57 level14 level71)
(sum level57 level22 level79)
(sum level57 level23 level80)
(sum level58 level1 level59)
(sum level58 level11 level69)
(sum level58 level14 level72)
(sum level58 level22 level80)
(sum level58 level23 level81)
(sum level59 level1 level60)
(sum level59 level11 level70)
(sum level59 level14 level73)
(sum level59 level22 level81)
(sum level59 level23 level82)
(sum level60 level1 level61)
(sum level60 level11 level71)
(sum level60 level14 level74)
(sum level60 level22 level82)
(sum level60 level23 level83)
(sum level61 level1 level62)
(sum level61 level11 level72)
(sum level61 level14 level75)
(sum level61 level22 level83)
(sum level61 level23 level84)
(sum level62 level1 level63)
(sum level62 level11 level73)
(sum level62 level14 level76)
(sum level62 level22 level84)
(sum level62 level23 level85)
(sum level63 level1 level64)
(sum level63 level11 level74)
(sum level63 level14 level77)
(sum level63 level22 level85)
(sum level63 level23 level86)
(sum level64 level1 level65)
(sum level64 level11 level75)
(sum level64 level14 level78)
(sum level64 level22 level86)
(sum level64 level23 level87)
(sum level65 level1 level66)
(sum level65 level11 level76)
(sum level65 level14 level79)
(sum level65 level22 level87)
(sum level65 level23 level88)
(sum level66 level1 level67)
(sum level66 level11 level77)
(sum level66 level14 level80)
(sum level66 level22 level88)
(sum level66 level23 level89)
(sum level67 level1 level68)
(sum level67 level11 level78)
(sum level67 level14 level81)
(sum level67 level22 level89)
(sum level67 level23 level90)
(sum level68 level1 level69)
(sum level68 level11 level79)
(sum level68 level14 level82)
(sum level68 level22 level90)
(sum level68 level23 level91)
(sum level69 level1 level70)
(sum level69 level11 level80)
(sum level69 level14 level83)
(sum level69 level22 level91)
(sum level69 level23 level92)
(sum level70 level1 level71)
(sum level70 level11 level81)
(sum level70 level14 level84)
(sum level70 level22 level92)
(sum level70 level23 level93)
(sum level71 level1 level72)
(sum level71 level11 level82)
(sum level71 level14 level85)
(sum level71 level22 level93)
(sum level71 level23 level94)
(sum level72 level1 level73)
(sum level72 level11 level83)
(sum level72 level14 level86)
(sum level72 level22 level94)
(sum level72 level23 level95)
(sum level73 level1 level74)
(sum level73 level11 level84)
(sum level73 level14 level87)
(sum level73 level22 level95)
(sum level73 level23 level96)
(sum level74 level1 level75)
(sum level74 level11 level85)
(sum level74 level14 level88)
(sum level74 level22 level96)
(sum level74 level23 level97)
(sum level75 level1 level76)
(sum level75 level11 level86)
(sum level75 level14 level89)
(sum level75 level22 level97)
(sum level75 level23 level98)
(sum level76 level1 level77)
(sum level76 level11 level87)
(sum level76 level14 level90)
(sum level76 level22 level98)
(sum level76 level23 level99)
(sum level77 level1 level78)
(sum level77 level11 level88)
(sum level77 level14 level91)
(sum level77 level22 level99)
(sum level77 level23 level100)
(sum level78 level1 level79)
(sum level78 level11 level89)
(sum level78 level14 level92)
(sum level78 level22 level100)
(sum level78 level23 level101)
(sum level79 level1 level80)
(sum level79 level11 level90)
(sum level79 level14 level93)
(sum level79 level22 level101)
(sum level79 level23 level102)
(sum level80 level1 level81)
(sum level80 level11 level91)
(sum level80 level14 level94)
(sum level80 level22 level102)
(sum level80 level23 level103)
(sum level81 level1 level82)
(sum level81 level11 level92)
(sum level81 level14 level95)
(sum level81 level22 level103)
(sum level81 level23 level104)
(sum level82 level1 level83)
(sum level82 level11 level93)
(sum level82 level14 level96)
(sum level82 level22 level104)
(sum level82 level23 level105)
(sum level83 level1 level84)
(sum level83 level11 level94)
(sum level83 level14 level97)
(sum level83 level22 level105)
(sum level83 level23 level106)
(sum level84 level1 level85)
(sum level84 level11 level95)
(sum level84 level14 level98)
(sum level84 level22 level106)
(sum level84 level23 level107)
(sum level85 level1 level86)
(sum level85 level11 level96)
(sum level85 level14 level99)
(sum level85 level22 level107)
(sum level85 level23 level108)
(sum level86 level1 level87)
(sum level86 level11 level97)
(sum level86 level14 level100)
(sum level86 level22 level108)
(sum level86 level23 level109)
(sum level87 level1 level88)
(sum level87 level11 level98)
(sum level87 level14 level101)
(sum level87 level22 level109)
(sum level87 level23 level110)
(sum level88 level1 level89)
(sum level88 level11 level99)
(sum level88 level14 level102)
(sum level88 level22 level110)
(sum level88 level23 level111)
(sum level89 level1 level90)
(sum level89 level11 level100)
(sum level89 level14 level103)
(sum level89 level22 level111)
(sum level89 level23 level112)
(sum level90 level1 level91)
(sum level90 level11 level101)
(sum level90 level14 level104)
(sum level90 level22 level112)
(sum level90 level23 level113)
(sum level91 level1 level92)
(sum level91 level11 level102)
(sum level91 level14 level105)
(sum level91 level22 level113)
(sum level91 level23 level114)
(sum level92 level1 level93)
(sum level92 level11 level103)
(sum level92 level14 level106)
(sum level92 level22 level114)
(sum level92 level23 level115)
(sum level93 level1 level94)
(sum level93 level11 level104)
(sum level93 level14 level107)
(sum level93 level22 level115)
(sum level93 level23 level116)
(sum level94 level1 level95)
(sum level94 level11 level105)
(sum level94 level14 level108)
(sum level94 level22 level116)
(sum level94 level23 level117)
(sum level95 level1 level96)
(sum level95 level11 level106)
(sum level95 level14 level109)
(sum level95 level22 level117)
(sum level95 level23 level118)
(sum level96 level1 level97)
(sum level96 level11 level107)
(sum level96 level14 level110)
(sum level96 level22 level118)
(sum level96 level23 level119)
(sum level97 level1 level98)
(sum level97 level11 level108)
(sum level97 level14 level111)
(sum level97 level22 level119)
(sum level97 level23 level120)
(sum level98 level1 level99)
(sum level98 level11 level109)
(sum level98 level14 level112)
(sum level98 level22 level120)
(sum level98 level23 level121)
(sum level99 level1 level100)
(sum level99 level11 level110)
(sum level99 level14 level113)
(sum level99 level22 level121)
(sum level99 level23 level122)
(sum level100 level1 level101)
(sum level100 level11 level111)
(sum level100 level14 level114)
(sum level100 level22 level122)
(sum level100 level23 level123)
(sum level101 level1 level102)
(sum level101 level11 level112)
(sum level101 level14 level115)
(sum level101 level22 level123)
(sum level101 level23 level124)
(sum level102 level1 level103)
(sum level102 level11 level113)
(sum level102 level14 level116)
(sum level102 level22 level124)
(sum level102 level23 level125)
(sum level103 level1 level104)
(sum level103 level11 level114)
(sum level103 level14 level117)
(sum level103 level22 level125)
(sum level103 level23 level126)
(sum level104 level1 level105)
(sum level104 level11 level115)
(sum level104 level14 level118)
(sum level104 level22 level126)
(sum level104 level23 level127)
(sum level105 level1 level106)
(sum level105 level11 level116)
(sum level105 level14 level119)
(sum level105 level22 level127)
(sum level105 level23 level128)
(sum level106 level1 level107)
(sum level106 level11 level117)
(sum level106 level14 level120)
(sum level106 level22 level128)
(sum level106 level23 level129)
(sum level107 level1 level108)
(sum level107 level11 level118)
(sum level107 level14 level121)
(sum level107 level22 level129)
(sum level107 level23 level130)
(sum level108 level1 level109)
(sum level108 level11 level119)
(sum level108 level14 level122)
(sum level108 level22 level130)
(sum level108 level23 level131)
(sum level109 level1 level110)
(sum level109 level11 level120)
(sum level109 level14 level123)
(sum level109 level22 level131)
(sum level109 level23 level132)
(sum level110 level1 level111)
(sum level110 level11 level121)
(sum level110 level14 level124)
(sum level110 level22 level132)
(sum level110 level23 level133)
(sum level111 level1 level112)
(sum level111 level11 level122)
(sum level111 level14 level125)
(sum level111 level22 level133)
(sum level111 level23 level134)
(sum level112 level1 level113)
(sum level112 level11 level123)
(sum level112 level14 level126)
(sum level112 level22 level134)
(sum level112 level23 level135)
(sum level113 level1 level114)
(sum level113 level11 level124)
(sum level113 level14 level127)
(sum level113 level22 level135)
(sum level113 level23 level136)
(sum level114 level1 level115)
(sum level114 level11 level125)
(sum level114 level14 level128)
(sum level114 level22 level136)
(sum level114 level23 level137)
(sum level115 level1 level116)
(sum level115 level11 level126)
(sum level115 level14 level129)
(sum level115 level22 level137)
(sum level115 level23 level138)
(sum level116 level1 level117)
(sum level116 level11 level127)
(sum level116 level14 level130)
(sum level116 level22 level138)
(sum level116 level23 level139)
(sum level117 level1 level118)
(sum level117 level11 level128)
(sum level117 level14 level131)
(sum level117 level22 level139)
(sum level117 level23 level140)
(sum level118 level1 level119)
(sum level118 level11 level129)
(sum level118 level14 level132)
(sum level118 level22 level140)
(sum level119 level1 level120)
(sum level119 level11 level130)
(sum level119 level14 level133)
(sum level120 level1 level121)
(sum level120 level11 level131)
(sum level120 level14 level134)
(sum level121 level1 level122)
(sum level121 level11 level132)
(sum level121 level14 level135)
(sum level122 level1 level123)
(sum level122 level11 level133)
(sum level122 level14 level136)
(sum level123 level1 level124)
(sum level123 level11 level134)
(sum level123 level14 level137)
(sum level124 level1 level125)
(sum level124 level11 level135)
(sum level124 level14 level138)
(sum level125 level1 level126)
(sum level125 level11 level136)
(sum level125 level14 level139)
(sum level126 level1 level127)
(sum level126 level11 level137)
(sum level126 level14 level140)
(sum level127 level1 level128)
(sum level127 level11 level138)
(sum level128 level1 level129)
(sum level128 level11 level139)
(sum level129 level1 level130)
(sum level129 level11 level140)
(sum level130 level1 level131)
(sum level131 level1 level132)
(sum level132 level1 level133)
(sum level133 level1 level134)
(sum level134 level1 level135)
(sum level135 level1 level136)
(sum level136 level1 level137)
(sum level137 level1 level138)
(sum level138 level1 level139)
(sum level139 level1 level140)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l4)
(fuelcost level22 l0 l4)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level11 l1 l2)
(connected l1 l3)
(fuelcost level14 l1 l3)
(connected l1 l4)
(fuelcost level23 l1 l4)
(connected l2 l1)
(fuelcost level11 l2 l1)
(connected l2 l3)
(fuelcost level11 l2 l3)
(connected l2 l4)
(fuelcost level1 l2 l4)
(connected l3 l1)
(fuelcost level14 l3 l1)
(connected l3 l2)
(fuelcost level11 l3 l2)
(connected l4 l0)
(fuelcost level22 l4 l0)
(connected l4 l1)
(fuelcost level23 l4 l1)
(connected l4 l2)
(fuelcost level1 l4 l2)

(at t0 l1)
(fuel t0 level140)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l0)
(at p3 l0)
(at p4 l4)
(at p5 l0)
)

(:goal
(and
(at p0 l3)
(at p1 l3)
(at p2 l1)
(at p3 l3)
(at p4 l2)
(at p5 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l0 level117 level23 level140)
   deleted: (at t0 l1) (fuel t0 level140)
   added: (at t0 l0) (fuel t0 level117)
   goals met: 0 of 6
2. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 6
3. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 6
4. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 6
5. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 6
6. (drive t0 l0 l4 level95 level22 level117)
   deleted: (at t0 l0) (fuel t0 level117)
   added: (at t0 l4) (fuel t0 level95)
   goals met: 0 of 6
7. (load p4 t0 l4)
   deleted: (at p4 l4)
   added: (in p4 t0)
   goals met: 0 of 6
8. (drive t0 l4 l2 level94 level1 level95)
   deleted: (at t0 l4) (fuel t0 level95)
   added: (at t0 l2) (fuel t0 level94)
   goals met: 0 of 6
9. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 6
10. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 1 of 6
11. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 2 of 6
12. (drive t0 l2 l1 level83 level11 level94)
   deleted: (at t0 l2) (fuel t0 level94)
   added: (at t0 l1) (fuel t0 level83)
   goals met: 2 of 6
13. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 6
14. (drive t0 l1 l3 level69 level14 level83)
   deleted: (at t0 l1) (fuel t0 level83)
   added: (at t0 l3) (fuel t0 level69)
   goals met: 3 of 6
15. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 4 of 6
16. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 5 of 6
17. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 6 of 6
